<?php
// +----------------------------------------------------------------------
// | used: ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006~2018 
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: hy <huangyi0101@aliyun.com>
// +----------------------------------------------------------------------

//本模块中的数据库配置参数
return [  

    //远程MySQL服务器连接配置
    'db_remote' => [
      // 数据库类型
      'type'           => 'mysql',
      // 服务器地址
      'hostname'       => '120.79.25.121',
      // 数据库名
      'database'       => 'ipmsv3',
      // 用户名
      'username'       => 'ipmsv3',
      // 密码
      'password'       => '12345678',
      // 端口
      'hostport'        => '3306',
      // 数据库编码默认采用utf8
      'charset'         => 'utf8',
      // 数据库表前缀
      'prefix'          => 'ipmsv3_',
    ]
];
